# tap for install
tap "tkengo/highway"

# install
# shell
brew "zsh"
brew "zsh-syntax-highlighting"

# for editor
brew "neovim"
brew "ctags"
brew "tkengo/highway/highway"

# update commands
brew "git"
brew "rsync"
brew "gawk"

# language
# brew "perl"

# language version managers
brew "uv"
brew "nodenv"

# for build
# brew "ruby-build"

# command line tools
brew "exa" # ls
brew "bat" # bat
brew "fd" # find
brew "procs" # ps
brew "ripgrep" # grep
brew "watch"
brew "htop"
brew "tig"
brew "imagemagick"
brew "jq"
brew "peco"
brew "tmux"
brew "tree"
brew "awscli"
