# tap for install
tap "tkengo/highway"

# install
brew "curl"
brew "git"
brew "wget"
brew "gcc"
brew "zlib"
brew "libzip"
brew "bzip2"
brew "readline"
brew "openssl"
brew "pkg-config"
brew "autoconf"

# shell
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# for editor
brew "neovim"
brew "ctags"
brew "tkengo/highway/highway"

# update commands
brew "git"
brew "rsync"
brew "gawk"

# language
# brew "perl"

# language version managers
brew "uv"
brew "nodenv"

# for build
# brew "ruby-build"

# command line tools
brew "awscli"
brew "bat" # cat
brew "curlie"
brew "dust"
brew "eza" # ls
brew "fd" # find
brew "ffmpeg"
brew "glow" # markdown viewer
brew "htop"
brew "imagemagick"
brew "jq"
brew "peco"
brew "procs" # ps
brew "ripgrep" # grep
brew "tig"
brew "tmux"
brew "tree"
brew "watch"
brew "zoxide" # cd
